{
  "backend/main.mo": "Defines trading, wallet, deposit, bonus, fee, and user profile types, initializes maps, and provides access-controlled profile and M-Pesa number management.",
  "backend/migration.mo": "Migration module converting the old actor state to the new structure by adding a default M-Pesa number field.",
  "feature_evidence.json": "Feature evidence report listing affected frontend files and components for updating the M-Pesa instructions UI using the backend-provided destination number.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their roles across hooks, components, pages, and UI modules.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining theme variables for light/dark modes and applying base visual styles.",
  "frontend/index.html": "Minimal HTML entry point containing the root mount element and script loader for the React app.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, theme provider, authentication gating, and profile setup dialog rendering.",
  "frontend/src/components/admin/BonusManagement.tsx": "Admin UI for viewing bonuses and applying new bonuses to users with form inputs and mutation handling.",
  "frontend/src/components/admin/DepositRequestsReview.tsx": "Displays pending deposit requests with M-Pesa details and allows admins to approve or reject them via dialog actions.",
  "frontend/src/components/admin/RevenuePanel.tsx": "Shows total platform revenue and lists recent trading fee events with timestamps and amounts.",
  "frontend/src/components/admin/TradingStatsPanel.tsx": "Provides trade statistics and a table of recent trades including direction, margin, status, and P&L.",
  "frontend/src/components/admin/UserDirectory.tsx": "Aggregates all users from trades and deposits and lets admins inspect user-specific activity.",
  "frontend/src/components/admin/UserInspector.tsx": "Displays detailed activity for a specific user including trades, deposits, bonuses, fees, and summary stats.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Simple screen informing the user of access denial with a button to return home.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout state and renders an auth button with loading handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for new users to set a display name and create their profile via a mutation.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, navigation, mobile menu, authentication-aware links, and routed content.",
  "frontend/src/components/trading/OpenTradesTable.tsx": "Renders a table of open trades with details and an action to close each trade.",
  "frontend/src/components/trading/TradeHistoryTable.tsx": "Displays closed trade history with pricing, P&L, fees, and timestamps.",
  "frontend/src/components/trading/TradeTicket.tsx": "Provides a form for opening trades, allowing users to pick pair, direction, leverage, and margin.",
  "frontend/src/components/wallet/DepositForm.tsx": "Form for submitting deposit requests, including M-Pesa details when applicable.",
  "frontend/src/components/wallet/MpesaInstructionsCard.tsx": "Shows M-Pesa deposit or withdrawal instructions and retrieves the M-Pesa number.",
  "frontend/src/components/wallet/RequestsHistory.tsx": "Combines deposits, bonuses, and fees into a unified transaction history table.",
  "frontend/src/components/wallet/WithdrawForm.tsx": "Form component for submitting withdrawal requests via M-Pesa or bank transfer using useWithdrawFunds.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useBonuses.ts": "Provides hooks to fetch bonuses and apply new bonuses, with cache invalidation and toast notifications.",
  "frontend/src/hooks/useCurrentUser.ts": "Hooks for fetching the caller’s user profile, role, admin status, and available balance from the backend.",
  "frontend/src/hooks/useFees.ts": "Hooks to fetch trading fees and platform revenue and submit new trading fees with cache updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and provider for Internet Identity authentication, login state, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook for fetching all backend data using the actor.",
  "frontend/src/hooks/useTrading.ts": "Hooks for opening, closing, and retrieving trades with automatic cache invalidation and toast feedback.",
  "frontend/src/hooks/useWallet.ts": "Wallet management hooks for deposits, withdrawals, M-Pesa number retrieval, and admin approvals with cache updates.",
  "frontend/src/index.css": "Tailwind CSS base file defining light and dark theme variables and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentity provider before rendering App.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard showing stats, navigation tabs, and admin-only management panels with authentication checks.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page displaying platform features, hero section, and navigation to trading.",
  "frontend/src/pages/TradingPage.tsx": "Authenticated trading interface showing balance, open trades, P&L, and trade ticket with tabbed views.",
  "frontend/src/pages/WalletPage.tsx": "Wallet management page showing balance, bonuses, fees, and providing deposit, withdraw, and history views.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, typography, container settings, and plugins for styling the frontend.",
  "project_state.json": "Defines the app’s project state, including features for trading, wallet operations, M-Pesa manual payments, bonuses, monetization, and admin tools, along with notes and issues."
}