{
  "backend/main.mo": "Defines core trading, wallet, bonus, and profile types with maps for storage plus admin‑protected MPesa number and basic profile endpoints.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend source files for documentation or build planning.",
  "frontend/index.css": "Tailwind base layer with OKLCH theme variables for light/dark mode and global background/foreground styling.",
  "frontend/index.html": "HTML entry point setting metadata, favicon, root div, and loading the main React script.",
  "frontend/ops/redeploy-runbook.md": "Runbook describing how to trigger, verify, and troubleshoot a full rebuild and redeploy of the application.",
  "frontend/ops/smoke-test-checklist.md": "Smoke‑test checklist covering landing page, navigation, authentication, profile setup, trading, and wallet functionality after deploy.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, handles post-login redirection, and renders the main app layout with theme, error boundary, and profile setup dialog.",
  "frontend/src/components/admin/BonusManagement.tsx": "Provides a form for admins to apply bonuses to users and displays existing bonus entries.",
  "frontend/src/components/admin/DepositRequestsReview.tsx": "Displays pending deposit requests and allows admins to approve or reject them with optional notes.",
  "frontend/src/components/admin/RevenuePanel.tsx": "Shows total platform revenue and lists recent trading fee events.",
  "frontend/src/components/admin/TradingStatsPanel.tsx": "Calculates and displays overall trading metrics and shows a table of recent trades.",
  "frontend/src/components/admin/UserDirectory.tsx": "Aggregates unique users from trades and deposits, listing them and enabling detailed user inspection.",
  "frontend/src/components/admin/UserInspector.tsx": "Displays a user's trades, deposits, bonuses, fees and summary metrics with tables and formatted stats.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access‑denied message with a button to return home.",
  "frontend/src/components/auth/AuthRequiredScreen.tsx": "Prompts unauthenticated users to log in via Internet Identity with error handling and navigation options.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component handling Internet Identity auth flow and related errors.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for creating a user profile with display name submission and mutation handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header, navigation, share link, and conditional admin/auth links.",
  "frontend/src/components/system/AppErrorBoundary.tsx": "Error boundary that catches rendering errors and shows a recovery screen with reset.",
  "frontend/src/components/system/CenteredLoadingCard.tsx": "Centered loading card showing a spinner and optional message.",
  "frontend/src/components/trading/OpenTradesTable.tsx": "Displays a table of open trades with details and a button to close each trade.",
  "frontend/src/components/trading/TradeHistoryTable.tsx": "Shows a table of closed trades with pricing, P&L, fees, and timestamps.",
  "frontend/src/components/trading/TradeTicket.tsx": "Provides a form for opening new trades, selecting pair, direction, leverage, and margin.",
  "frontend/src/components/wallet/DepositForm.tsx": "Form for submitting deposit requests, including M‑Pesa details when applicable.",
  "frontend/src/components/wallet/MpesaInstructionsCard.tsx": "Displays M‑Pesa deposit or withdrawal instructions based on the selected operation.",
  "frontend/src/components/wallet/RequestsHistory.tsx": "Combines deposit, bonus, and fee records into a unified transaction history table.",
  "frontend/src/components/wallet/WithdrawForm.tsx": "Form for requesting withdrawals, supporting M‑Pesa phone entry when selected.",
  "frontend/src/config/branding.ts": "Exports basic app branding constants like name, tagline, and description.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the user identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useBonuses.ts": "Provides React Query hooks for fetching user and system bonuses and applying bonuses with cache invalidation and toast feedback.",
  "frontend/src/hooks/useCurrentUser.ts": "Defines hooks to fetch the caller’s user profile, role, admin status, and balance using the backend actor.",
  "frontend/src/hooks/useFees.ts": "Offers hooks to read trading fees and platform revenue and to submit trading fees with relevant query invalidations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context provider and hook for login, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Contains a placeholder hook for fetching combined backend data using React Query.",
  "frontend/src/hooks/useTrading.ts": "Provides hooks for opening and closing trades and retrieving open, historical, and all trades with cache updates.",
  "frontend/src/hooks/useWallet.ts": "Includes hooks for deposits, withdrawals, deposit approvals, and related status queries with toast notifications.",
  "frontend/src/index.css": "Tailwind base configuration defining light/dark theme variables, utilities, and premium gradient styles.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and renders the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page enforcing authentication and admin checks and rendering tabs for deposits, bonuses, revenue, trading, and users.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero content, feature list, and login flow with config validation and error handling.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page showing an error message and a button to return home.",
  "frontend/src/pages/TradingPage.tsx": "Authenticated trading interface showing balance, open trades, P&L, and tabs for trading actions and history.",
  "frontend/src/pages/WalletPage.tsx": "Authenticated wallet page for viewing balance, depositing, withdrawing, and reviewing transaction history.",
  "frontend/src/utils/authConfig.ts": "Validates the Internet Identity provider URL and returns errors for missing or invalid configuration.",
  "frontend/src/utils/loginRecovery.ts": "Wraps login attempts with a timeout and standardized error handling for common login failures.",
  "frontend/src/utils/postLoginRedirect.ts": "Stores, retrieves, and clears the intended post-login navigation path using sessionStorage.",
  "frontend/src/utils/shareableLink.ts": "Builds a shareable hash-based URL that works in canister deployments.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and removing them from URLs.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, typography, animations, and extended theme settings for layout, fonts, shadows, and keyframes.",
  "project_state.json": "Metadata describing the project’s state, existing login-related issues, and feature requirements for fixing authentication and onboarding flows."
}