{
  "backend/main.mo": "Defines core trading, account, deposit, bonus, fee, and profile types plus maps and authorization logic, providing getters/setters like M-Pesa number and profile operations.",
  "feature_evidence.json": "Describes two rebuild/redeploy and smoke‑test features, listing involved files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend source files covering styling, hooks, components, and pages.",
  "frontend/index.css": "Defines global Tailwind CSS variables and themes, including extensive OKLCH color tokens and dark‑mode overrides.",
  "frontend/index.html": "HTML entry point that loads the app root and main TypeScript module with relative asset paths.",
  "frontend/ops/redeploy-runbook.md": "Runbook outlining prerequisites, preflight checks, and step‑by‑step instructions for a clean rebuild and redeploy.",
  "frontend/ops/redeploy.sh": "Shell script automating clean builds, dependency installs, backend binding generation, frontend build, canister deploy, and post‑deploy checks.",
  "frontend/ops/smoke-test-checklist.md": "Manual smoke‑test checklist verifying routing, asset loading, errors, and core navigation after deployment.",
  "frontend/ops/smoke-test-report-template.md": "Template for documenting smoke‑test results with deployment info, environment details, and test status fields.",
  "frontend/src/App.tsx": "Sets up the app's router, authentication checks, post-login redirect, and global providers including theme, error boundary, and toaster.",
  "frontend/src/components/admin/BonusManagement.tsx": "Provides a UI for admins to create and apply bonuses to users and lists existing bonus records.",
  "frontend/src/components/admin/DepositRequestsReview.tsx": "Displays pending deposit requests and allows admins to approve or reject them with optional notes.",
  "frontend/src/components/admin/RevenuePanel.tsx": "Shows total platform revenue and a table of recent trading fee events.",
  "frontend/src/components/admin/TradingStatsPanel.tsx": "Aggregates trading statistics and displays recent trade activity with status and PnL info.",
  "frontend/src/components/admin/UserDirectory.tsx": "Builds a directory of all users derived from trades and deposits and provides navigation to inspect individual users.",
  "frontend/src/components/admin/UserInspector.tsx": "Displays detailed user activity including trades, deposits, bonuses, fees, and P&L, using fetched data filtered by user principal.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access denied message with an option to return home.",
  "frontend/src/components/auth/AuthRequiredScreen.tsx": "Prompts unauthenticated users to log in, handles login errors, and provides navigation back home.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides login/logout functionality with error handling and Internet Identity integration.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog allowing new users to create a profile by submitting a display name, with mutation and error handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with navigation, authentication-aware links, mobile menu, and share-link functionality.",
  "frontend/src/components/system/AppErrorBoundary.tsx": "Catches application errors and displays a recovery screen with an option to reset and reload the app.",
  "frontend/src/components/system/CenteredLoadingCard.tsx": "Shows a centered loading card with a spinner and optional message.",
  "frontend/src/components/trading/CandlestickChart.tsx": "Simulates and displays live‑updating OHLC candlestick data for a currency pair, handling resizing, loading, and periodic updates.",
  "frontend/src/components/trading/OpenTradesTable.tsx": "Renders a table of open trades with metadata and allows closing trades via mutation.",
  "frontend/src/components/trading/TradeHistoryTable.tsx": "Displays closed trades with pricing, P&L, fees, and timestamps in a history table.",
  "frontend/src/components/trading/TradeTicket.tsx": "Form for opening a new trade, letting users select pair, direction, leverage, and margin before submitting.",
  "frontend/src/components/wallet/DepositForm.tsx": "Deposit form supporting M‑Pesa and bank payments, submitting deposit requests and resetting on success.",
  "frontend/src/components/wallet/MpesaInstructionsCard.tsx": "Shows dynamic M‑Pesa payment instructions for deposits or withdrawals using fetched wallet number.",
  "frontend/src/components/wallet/RequestsHistory.tsx": "Combines deposits, bonuses, and fees into a unified sortable history table with statuses and timestamps.",
  "frontend/src/components/wallet/WithdrawForm.tsx": "Renders a withdrawal form supporting M-Pesa or bank transfer and triggers a withdraw mutation on submit.",
  "frontend/src/config/branding.ts": "Defines static app branding strings including name, tagline, and description.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useBonuses.ts": "Provides queries and mutations for fetching, applying, and managing user and system bonuses via the backend actor.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the caller's user profile, role, admin status, and available balance using the backend actor.",
  "frontend/src/hooks/useFees.ts": "Handles trading fee queries and submitting fees, with cache invalidation and toast notifications.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, storing identity state and exposing login, logout, and status helpers.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook for fetching grouped backend data using the actor.",
  "frontend/src/hooks/useTrading.ts": "Provides hooks for opening, closing, and retrieving trades with backend integration and cache updates.",
  "frontend/src/hooks/useWallet.ts": "Implements deposit, withdrawal, and deposit request management hooks with backend calls and notifications.",
  "frontend/src/index.css": "Defines Tailwind layers and custom light/dark theme variables plus utility classes for gradients and text effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/AdminPage.tsx": "Renders the admin dashboard with authentication, role checks, and multiple admin management tabs.",
  "frontend/src/pages/LandingPage.tsx": "Displays the marketing landing page with login flow, feature highlights, and risk disclaimer.",
  "frontend/src/pages/NotFoundPage.tsx": "Shows a 404 page with a message and navigation back to home.",
  "frontend/src/pages/TradingPage.tsx": "Provides the trading interface with balance, charts, open trades, history, and authentication checks.",
  "frontend/src/pages/WalletPage.tsx": "Renders the wallet dashboard for deposits, withdrawals, balances, and transaction history.",
  "frontend/src/utils/authConfig.ts": "Validates II provider configuration and returns user-friendly errors.",
  "frontend/src/utils/loginRecovery.ts": "Wraps login attempts with timeout handling and error normalization.",
  "frontend/src/utils/postLoginRedirect.ts": "Stores, retrieves, and clears intended post-login navigation paths.",
  "frontend/src/utils/shareableLink.ts": "Builds shareable URLs using hash-based routing for canister-safe links.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and remove them from the hash.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, shadows, fonts, animations, and plugin integrations.",
  "project_state.json": "Defines project metadata, current issues, and deployment-related feature requirements."
}