{
  "kind": "build_request",
  "title": "Retry build and redeploy after deployment error",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Trigger a fresh rebuild and redeploy of the existing app (frontend + backend) without introducing product changes, since the last deployment did not complete successfully.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "A new deployment completes without errors and produces a working canister-hosted URL.",
        "The deployed app loads successfully at the root route (/) in a new browser session."
      ]
    },
    {
      "id": "REQ-2",
      "text": "After redeploy, run the documented smoke tests to confirm the deployment is healthy (landing page, hash-based routing, Internet Identity login, and core authenticated routes).",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "Landing page (/) loads and hard refresh does not show a 404/Not Found.",
        "Hash-based routes (/#/trading, /#/wallet, /#/admin) open directly and still work after hard refresh.",
        "Internet Identity login completes and returns to the app successfully.",
        "Authenticated pages (/trading and /wallet) render without runtime errors; admin page is accessible only for admin users.",
        "No missing static assets (e.g., favicon/logo) and no critical console errors during the smoke test run."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only Shadcn UI components).",
    "Do not modify files listed in SYSTEM_CONTEXT.frontend.immutablePaths.",
    "Respect the single-actor backend architecture (all Motoko logic in backend/main.mo); only add backend/migration.mo if a state migration is required."
  ],
  "nonGoals": [
    "Implementing new product features unrelated to completing a successful redeploy.",
    "Refactoring existing trading, wallet, or admin functionality unless required to resolve the deployment failure."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}