{
  "kind": "build_request",
  "title": "Fix login and onboarding flow so users can log in and get started",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix Internet Identity login so the Login button reliably opens the Internet Identity provider in production and returns an authenticated identity to the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "this one its working but i cant login or get started"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the Login button opens the Internet Identity authorization flow (no silent failure).",
        "After completing Internet Identity login, the app detects a non-anonymous identity (authenticated state becomes true).",
        "If the Internet Identity provider URL is missing/misconfigured, the app shows a clear user-facing error message explaining that login cannot start due to configuration and does not get stuck in a loading state."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the \"Get Started\" / \"Start Trading\" onboarding behavior so unauthenticated users are prompted to log in first instead of being navigated to an authenticated-only route that immediately redirects back to the landing page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "this one its working but i cant login or get started"
        ]
      },
      "acceptanceCriteria": [
        "When not authenticated, clicking \"Get Started\" initiates login (or presents a clear login prompt) rather than navigating to /trading.",
        "After successful login, the user is taken to the intended page (e.g., Trading) without manually re-clicking buttons.",
        "No navigation loop occurs between /trading and / (landing) for unauthenticated users."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve unauthenticated gating UX on authenticated pages (Trading, Wallet, Admin) so users see a clear call-to-action instead of a blank screen while being redirected or blocked.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "this one its working but i cant login or get started"
        ]
      },
      "acceptanceCriteria": [
        "If an unauthenticated user lands on /trading or /wallet, they see a clear message explaining that login is required, with a visible Login action.",
        "If an unauthenticated user lands on /admin, they see a clear message explaining that login is required (and, if logged in but not admin, the existing access denied screen continues to be used).",
        "No route returns an empty page (null) in a way that appears as a broken or blank UI to the user."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Make login and onboarding errors observable: surface Internet Identity login errors and profile creation errors to the user in the UI, and provide a simple recovery action (e.g., retry login).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "this one its working but i cant login or get started"
        ]
      },
      "acceptanceCriteria": [
        "If Internet Identity login fails, the user sees an error message in the UI (not only in the console) with a retry option.",
        "If profile setup is required (no user profile exists after login), the profile setup dialog remains the path to continue, and any failures show an actionable error message.",
        "After a successful profile creation, the dialog closes automatically (or is no longer shown) and the user can proceed to Trading/Wallet."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend/immutablePaths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui). Compose new components or adjust other application code instead.",
    "Backend must remain a single Motoko actor (all logic in backend/main.mo); only add migration code if persistent state schema changes are required."
  ],
  "nonGoals": [
    "Implementing any third-party authentication providers other than Internet Identity.",
    "Adding new trading, wallet, or admin features unrelated to fixing login/onboarding.",
    "Introducing external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}