{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Redeploy runbook + smoke-test verification for existing ForexPro app",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Provide a repeatable, no-product-change procedure to trigger a fresh rebuild and redeploy, plus post-deploy checks focused on canister-safe routing and static assets.",
      "acceptanceCriteria": [
        "A new deployment completes without errors and produces a working canister-hosted URL.",
        "The deployed app loads successfully at the root route (/) in a new browser session."
      ],
      "file_operations": [
        {
          "path": "frontend/ops/redeploy-runbook.md",
          "operation": "modify",
          "description": "Tighten the redeploy procedure to be explicitly “no code/product changes”, add a clear preflight checklist (hash routing, relative asset paths, root route), and add an explicit post-deploy verification section aligned to canister-hosted behavior (hard refresh, deep links)."
        },
        {
          "path": "frontend/ops/redeploy.sh",
          "operation": "create",
          "description": "Add an ops helper script that runs the documented clean rebuild + redeploy sequence and prints the expected next manual verification steps (kept non-invasive; does not alter product behavior)."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Verify canister-safe, relative asset references (favicon + module script) remain relative and resilient to redeploys; adjust only if required to prevent missing assets at runtime."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the documented smoke tests cover landing, hash-based routing, Internet Identity login, and core authenticated routes (including admin-only access) after redeploy.",
      "acceptanceCriteria": [
        "Landing page (/) loads and hard refresh does not show a 404/Not Found.",
        "Hash-based routes (/#/trading, /#/wallet, /#/admin) open directly and still work after hard refresh.",
        "Internet Identity login completes and returns to the app successfully.",
        "Authenticated pages (/trading and /wallet) render without runtime errors; admin page is accessible only for admin users.",
        "No missing static assets (e.g., favicon/logo) and no critical console errors during the smoke test run."
      ],
      "file_operations": [
        {
          "path": "frontend/ops/smoke-test-checklist.md",
          "operation": "modify",
          "description": "Align the checklist wording and pass/fail criteria directly to the acceptance criteria: (1) root route + hard refresh, (2) direct hash deep-links for trading/wallet/admin + hard refresh, (3) Internet Identity login roundtrip, (4) authenticated route rendering checks, (5) admin-only access verification, and (6) static asset + console error checks."
        },
        {
          "path": "frontend/ops/smoke-test-report-template.md",
          "operation": "create",
          "description": "Add a lightweight smoke test report template (deployment URL, environment, tester, results per section, and captured console errors) to standardize post-redeploy validation outcomes."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add/adjust minimal, non-feature-changing safeguards to keep smoke-test paths reliable (hash-based routing remains configured; not-found handling remains wired) and ensure any future regressions to routing behavior are less likely to slip through."
        }
      ]
    }
  ]
}